# -*- Mode: org -*-
# -*- coding: utf-8 -*-

#+title: /All Together Now/: A Synchronous Platform for Distributed Spatial Audio
#+author: Thomas Rushton

#+startup: overview
#+export_file_name: out/smc-2025
#+options: toc:nil num:3 date:nil author:nil
#+latex_class: smc-2025
#+bibliography: smc2025bib.bib
# Bastards want us to use bibtex. Got to create a separate,
# bibtex-compatible file for this paper.
#+cite_export: bibtex
#+latex_header_extra: \RequirePackage[]{./out/smc-2025}

#+begin_abstract
State-of-the-art systems for spatial and immersive audio lie beyond
the reach of many potential users due to the financial and technical
investments that they demand. The risks associated with buying into a
closed, centralised system of inflexible hardware and specialist
software mean that, although areas of considerable research interest
in recent years, significant barriers-to-entry exist with regard to
immersive audio and virtual acoustics via practical application of
sound field synthesis techniques. It is possible, however, to
parallelise sound field synthesis algorithms and distribute them,
subject to guarantees regarding the timing of distributed signal
processors. Exploiting one of a number of low-cost embedded hardware
platforms to have emerged over the past decade, and open-source
software implementing the network Precision Time Protocol, we show
that low-cost, networked audio devices can be synchronised to a degree
sufficient to support time-sensitive audio applications.
#+end_abstract

** What's the cost per channel again?

Excluding the cost of a computer, speakers and cables:

#+begin_src emacs-lisp
(let* ((teensy-cost 31.5)
       (audio-shield-cost 14.4)
       (ethernet-kit-cost 3.9)
       (switch-cost 200)
       (computer-cost 1500)
       (num-ports 24)
       (output-channels-per-port 2)
       (num-channels (* output-channels-per-port num-ports))
       (basic-cost (+ switch-cost
                      (* num-ports
                         (+ teensy-cost audio-shield-cost ethernet-kit-cost))))
       (cost-per-channel (/ basic-cost num-channels))
       (cost-per-channel-with-pc (/ (+ basic-cost computer-cost) num-channels)))
  (format
   (string-join '("€ %.2f %d-channel system"
                  "€ %.2f (incl. computer)"
                  "€ %.2f per channel"
                  "€ %.2f per channel (incl. computer)") "\n")
   basic-cost num-channels
   (+ basic-cost computer-cost)
   cost-per-channel
   cost-per-channel-with-pc))
#+end_src

#+RESULTS:
: € 1395.20 48-channel system
: € 2895.20 (incl. computer)
: € 29.07 per channel
: € 60.32 per channel (incl. computer)

** And how far does sound travel in, e.g., 1 \micro{}s?

#+begin_src emacs-lisp
(let* ((c 343.)
       (time-s 1e-6)
       (cmpm (/ 1. 1e-2))
       (mmpm (/ 1. 1e-3))
       (dist-m (* c time-s)))
  (format "%.2f m\n%.2f cm\n%.2f mm" dist-m (* dist-m cmpm) (* dist-m mmpm)))
#+end_src

#+RESULTS:
: 0.00 m
: 0.03 cm
: 0.34 mm

** Want to calculate PPM?

E.g. -4 ms drift over the course of 600 seconds,
\(1\times10^{6}\frac{-4\times10{-3}}{600}\)

#+begin_src emacs-lisp
(format "%f ppm" (* (/ -4e-3 600) 1e6)) 
#+end_src

#+RESULTS:
: -6.666667 ppm

* Background
:PROPERTIES:
:CUSTOM_ID: sec:bg
:END:

The importance of sound in the immersive experience is
well-established\nbsp[cite:@geronazzoSonic2023]; if, however, the auditory
aspect of virtual and extended reality remains comparatively neglected
when considered alongside other sensory
channels\nbsp[cite:@serafinReflections2020], this may be ascribed, in
part, to the complexity and cost associated with immersive audio
installations. Large-scale, multichannel spatial audio systems are
typically very expensive, centralised installations, reliant on
proprietary hardware and specialist software. Such systems scale
poorly and demand significant computing power to serve DSP
needs\nbsp[cite:@rushtonNetworked2024]. Particularly in the case where one
wishes for numerous individuals to share in a participatory auditory
experience, unencumbered by headsets, an immersive acoustic
environment is desirable, and yet may lie out of reach, for practical
purposes. The exclusivity of multichannel audio systems has a chilling
effect on research and creativity.

#+begin_src emacs-lisp :exports none
(let* ((usd-eur .96)
       (cm5 51.72)
       (cm5io 18.07)
       (i2s-hat 18.91)
       (t41 31.5)
       (audio-shield 14.4)
       (ethernet-addon 3.9)
       (rpi (+ cm5 cm5io i2s-hat))
       (teensy (* usd-eur (+ t41 audio-shield ethernet-addon))))
  (format "RPi cost: € %.2f\nTeensy cost: € %.2f" rpi teensy))
#+end_src

#+RESULTS:
: RPi cost: € 88.70
: Teensy cost: € 47.81

#+name: tab:platforms
#+caption: Selected embedded computing platforms listed with their
#+caption: corresponding microcontroller (MCU) or system on chip (SoC), availaibility of
#+caption: selected functionality, and approximate cost per unit (rounded
#+caption: to the nearest Euro) as of March 2025.
#+attr_latex: :float multicolumn :align lllllr :booktabs t
| Platform         | MCU/SoC                         | Memory       | Ethernet | PTP | Unit Cost |
|------------------+---------------------------------+--------------+----------+-----+-----------|
| Raspberry Pi CM5 | Broadcom BCM2712                | 2 GB SDRAM   | Yes      | Yes | € 89      |
| Bela             | Texas Instruments Sitara AM3358 | 512 MB SDRAM | Yes      | Yes | € 190     |
| ESP32-LyraT      | ESP32-WROVER-B                  | 4 MB PSRAM   | Yes      | No  | € 21      |
| Teensy 4.1       | NXP iMXRT1062                   | 1024 KB SRAM | Yes      | Yes | € 48      |
| Daisy Seed       | STM32H750IB                     | 65 MB SDRAM  | No       | Yes | € 25      |

In simple terms, to serve a large listening area with the greatest
possible fidelity, sound field synthesis
algorithms\nbsp[cite:@ahrensAnalytic2012] such as wave field synthesis
(WFS) and higher order ambisonics (HOA) call for large numbers of
loudspeakers. To minimise spatial aliasing, WFS demands a dense array
of secondary point sources\nbsp[cite:@winterGeometric2018]; to achieve the
same end, ambisonics requires a number of speakers sufficient to
reproduce spherical harmonics of higher
order\nbsp[cite:@nicolSound2017]. Conventional systems for meeting these
needs range from square arrays of 64-channels backed up by a single
Mac Pro and multichannel audio digital interface (MADI)
hardware\nbsp[cite:@graniGestural2016], to arrays of hundreds of speakers
requiring clusters of powerful computers to provide
DSP\nbsp[cite:@noisternigDispositif2012;@baalmanRenewed2007];[fn:9] in
either case, conservative cost estimates on the order of hundreds of
euros per channel may be reached\nbsp[cite:@rushtonNetworked2024].

** Sampling Frequency Conditioning

For the first concern, two approaches are possible; one is to take
incoming time-exchange information, over PTP for example, and use this
information to condition the primary clock source --- most likely a
crystal oscillator (XO) --- on a given device. This can be achieved by
replacing the static XO with one that is voltage controlled (a VCXO),
or with a direct digital synthesiser (DDS); in either case, a
component that is capable of providing a variable clock
frequency\nbsp[cite:@friedtNetwork2023]. Such an approach requires that
physical modifications are made to the device, an obstacle to
accessibility that will be given no further consideration here. The
second approach is to exploit the functionality of the audio subsystem
of the SoC or MCU, which typically provides a hardware timer, derived
from the XO, and adjustable via a phase locked loop (PLL), to govern
the audio sampling rate. The PLL is configurable via hardware
registers representing dividers to be applied to the XO frequency to
achieve the desired sampling frequency.

Whereas the Raspberry Pi's SoC provides only 12-bits of clock divider
resolution, perhaps owing to the fact that it is an all-purpose device
whose audio subsystem is governed by a general purpose I/O (GPIO)
clock, the Teensy's NXP iMXRT1062 MCU, having a dedicated audio PLL,
offers 30-bits. For this reason, the MCU's PTP support, and Bela's
high price tag, Teensy 4.1 is the device upon which our implementation
is based.

In the core Teensy codebase, the iMXRT1062's PTP functionality lies
unimplemented. Fortunately, thanks to recent research
efforts\nbsp[cite:@schleusnerSubMicrosecond2024], PTP functions are now
available and open-source. This functionality is only directly
relevant to the MCU's ethernet subsystem, however; using it to
condition the system's audio clock is a separate matter. A full
description of the PTP algorithm lies beyond the scope of this paper,
but essentially, following per-second exchange of timestamped ethernet
packets between a clock authority and a clock subscriber, the latter,
assuming a symmetrical transmission path, has enough information to
calculate its offset from the former, producing a figure in
nanoseconds by which, for a given second, it must adjust its ethernet
timer. Taking this \unit{\ns\per\s} adjustment, and assuming that
ethernet and audio clocks are derived from the same clock source,
i.e. the XO (a safe assumption in the case of the iMXRT1062; see
cref:fig:arch), achieving sample rate parity is a relatively simple
case of applying the adjustment, \(a\), to the nominal sampling
frequency, \(f_{s}\), to produce a target sampling frequency,
\(\hat{f}_{s}\)

#+NAME: eq:fine-num-1
\begin{equation}
\hat{f}_{s} = f_{s}\left(1 + \frac{a}{\num{1e9}}\right)\;.
\end{equation}
For example, should a clock subscriber, running at a nominal
\qty{48}{\kHz}, drift fast over a given second by \qty{1750}{\nano\s},
the new sampling frequency to be applied should be

#+begin_src emacs-lisp :exports none
(let* ((fs 48e3)
       (drift -1)
       (nsps 1e9)
       (ratio (+ 1 (/ drift nsps)))
       (newfs (* fs ratio))
       (frac-diff (/ 1. (- newfs fs))))
  (format "Ratio: %.9f, new fs: %.9f Hz, fractional diff: 1/%.1f Hz" ratio newfs frac-diff))
#+end_src

#+RESULTS:
: Ratio: 0.999999999, new fs: 47999.999952000 Hz, fractional diff: 1/-20833.3 Hz

#+NAME: eq:fs-example
\begin{align*}
\hat{f}_{s} &= \num{48000}\left(1 + \frac{-1750}{\num{1e9}}\right) \\
  &= \num{48000} \times \num{0.999998925} \\
  &= \qty{47999.916}{\Hz}\;,
\end{align*}
or about \(\frac{1}{12}\)\unit{\Hz} slower. An adjustment of
\qty{1}{\ns\per\s} at a nominal \qty{48}{\kHz} corresponds to about
one twenty-one-thousandth of a cycle of the audio clock. Whereas the
Broadcom BCM2712 offers around \(\frac{1}{14}\)\unit{\Hz} resolution
at this frequency, the iMXRT1062 provides better than one in
six-hundred-thousand.

